## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-superset/actions/runs/12244111213).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.ecs_task_ssm_parameters will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecs_task_ssm_parameters" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # data.aws_iam_policy_document.superset_athena_read will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "superset_athena_read" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetDataCatalog",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AthenaDataCatalogAccess"
        }
      + statement {
          + actions   = [
              + "athena:BatchGetNamedQuery",
              + "athena:BatchGetQueryExecution",
              + "athena:CreatePreparedStatement",
              + "athena:DeletePreparedStatement",
              + "athena:GetNamedQuery",
              + "athena:GetPreparedStatement",
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:GetQueryResultsStream",
              + "athena:GetTableMetadata",
              + "athena:GetWorkGroup",
              + "athena:ListDataCatalogs",
              + "athena:ListDatabases",
              + "athena:ListNamedQueries",
              + "athena:ListQueryExecutions",
              + "athena:ListTableMetadata",
              + "athena:ListTagsForResource",
              + "athena:ListWorkGroups",
              + "athena:StartQueryExecution",
              + "athena:StopQueryExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AthenaRead"
        }
      + statement {
          + actions   = [
              + "glue:BatchGetPartition",
              + "glue:GetDatabase",
              + "glue:GetDatabases",
              + "glue:GetPartition",
              + "glue:GetPartitions",
              + "glue:GetTable",
              + "glue:GetTableVersion",
              + "glue:GetTableVersions",
              + "glue:GetTables",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:glue:ca-central-1:739275439843:catalog",
              + "arn:aws:glue:ca-central-1:739275439843:database/operations_aws_production",
              + "arn:aws:glue:ca-central-1:739275439843:table/operations_aws_production/*",
              + (known after apply),
            ]
          + sid       = "GlueRead"
        }
      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-curated-production",
              + "arn:aws:s3:::cds-data-lake-curated-production/*",
              + "arn:aws:s3:::cds-data-lake-transformed-production",
              + "arn:aws:s3:::cds-data-lake-transformed-production/*",
            ]
          + sid       = "S3AthenaSourceBucketRead"
        }
      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-athena-production",
              + "arn:aws:s3:::cds-data-lake-athena-production/*",
            ]
          + sid       = "S3AthenaResultBucketWrite"
        }
    }

  # data.aws_iam_policy_document.superset_ecs_task_role will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "superset_ecs_task_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_acm_certificate.superset will be created
  + resource "aws_acm_certificate" "superset" {
      + arn                       = (known after apply)
      + domain_name               = "superset.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.superset.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "superset.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.superset.cdssandbox.xyz",
          + "superset.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.superset will be created
  + resource "aws_acm_certificate_validation" "superset" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_athena_data_catalog.data_lake will be created
  + resource "aws_athena_data_catalog" "data_lake" {
      + arn         = (known after apply)
      + description = "Data catalog for access to the CDS data lake"
      + id          = (known after apply)
      + name        = "data-lake-production"
      + parameters  = {
          + "catalog-id" = "739275439843"
        }
      + tags_all    = (known after apply)
      + type        = "GLUE"
    }

  # aws_cloudwatch_metric_alarm.superset_load_balancer_healthy_hosts will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_load_balancer_healthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "There are no healthy hosts for the Superset load balancer in a 1 minute period."
      + alarm_name                            = "load-balancer-healthy-hosts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "HealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Maximum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_load_balancer_response_time will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_load_balancer_response_time" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Response time for the Superset load balancer is greater than 2 seconds over 5 minutes."
      + alarm_name                            = "load-balancer-response-time"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 3
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + ok_actions                            = (known after apply)
      + tags                                  = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 2
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "response_time"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = (known after apply)
              + metric_name = "TargetResponseTime"
              + namespace   = "AWS/ApplicationELB"
              + period      = 60
              + stat        = "Average"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_cloudwatch_metric_alarm.superset_load_balancer_unhealthy_hosts will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_load_balancer_unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "There are unhealthy Superset load balancer hosts in a 1 minute period."
      + alarm_name                            = "load-balancer-unhealthy-hosts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Maximum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_ecr_lifecycle_policy.superset-image will be created
  + resource "aws_ecr_lifecycle_policy" "superset-image" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 git SHA tagged images"
                      + rulePriority = 10
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "sha-",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images older than 7 days"
                      + rulePriority = 20
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "superset"
    }

  # aws_ecr_repository.superset-image will be created
  + resource "aws_ecr_repository" "superset-image" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "superset"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_task_definition.superset_upgrade will be created
  + resource "aws_ecs_task_definition" "superset_upgrade" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "superset-upgrade"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # aws_elasticache_cluster.superset will be created
  + resource "aws_elasticache_cluster" "superset" {
      + apply_immediately          = (known after apply)
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "cds-redis"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "7.1"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = (known after apply)
      + network_type               = (known after apply)
      + node_type                  = "cache.t2.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "default.redis7"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = (known after apply)
      + snapshot_window            = (known after apply)
      + subnet_group_name          = "cds-redis-subnet-grp"
      + tags                       = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                   = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + transit_encryption_enabled = (known after apply)
    }

  # aws_elasticache_subnet_group.superset will be created
  + resource "aws_elasticache_subnet_group" "superset" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "cds-redis-subnet-grp"
      + subnet_ids  = (known after apply)
      + tags_all    = (known after apply)
      + vpc_id      = (known after apply)
    }

  # aws_iam_policy.superset_athena_read will be created
  + resource "aws_iam_policy" "superset_athena_read" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "SupersetAthenaRead"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Terraform" = "true"
        }
      + tags_all         = {
          + "Terraform" = "true"
        }
    }

  # aws_iam_role.superset_athena_read will be created
  + resource "aws_iam_role" "superset_athena_read" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "This role allows the Superset ECS task to read from Athena as a datasource"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SupersetAthenaRead"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Terraform" = "true"
        }
      + tags_all              = {
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.superset_waf_logs will be created
  + resource "aws_iam_role" "superset_waf_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "superset-waf-logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.superset_waf_logs will be created
  + resource "aws_iam_role_policy" "superset_waf_logs" {
      + id          = (known after apply)
      + name        = "superset-waf-logs"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cbs-satellite-257394494478/*",
                          + "arn:aws:s3:::cbs-satellite-257394494478",
                        ]
                    },
                  + {
                      + Action   = "iam:CreateServiceLinkedRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::*:role/aws-service-role/wafv2.amazonaws.com/AWSServiceRoleForWAFV2Logging"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.superset_athena_read will be created
  + resource "aws_iam_role_policy_attachment" "superset_athena_read" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SupersetAthenaRead"
    }

  # aws_kinesis_firehose_delivery_stream.superset_waf_logs will be created
  + resource "aws_kinesis_firehose_delivery_stream" "superset_waf_logs" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-superset"
      + tags_all       = (known after apply)
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-257394494478"
          + buffering_interval = 300
          + buffering_size     = 5
          + compression_format = "GZIP"
          + custom_time_zone   = "UTC"
          + prefix             = "waf_acl_logs/AWSLogs/257394494478/"
          + role_arn           = (known after apply)
          + s3_backup_mode     = "Disabled"
        }

      + server_side_encryption {
          + enabled  = true
          + key_type = "AWS_OWNED_CMK"
        }
    }

  # aws_kms_key.cloudwatch_alerts will be created
  + resource "aws_kms_key" "cloudwatch_alerts" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "SNS topic for CloudWatch alarm alerts"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::257394494478:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ca-central-1.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow_CloudWatch_for_CMK"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "CloudwatchEvents"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_lb.superset will be created
  + resource "aws_lb" "superset" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "superset-staging"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                                                     = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "cbs-satellite-257394494478"
          + enabled = true
          + prefix  = "lb_logs"
        }
    }

  # aws_lb_listener.superset will be created
  + resource "aws_lb_listener" "superset" {
      + arn                      = (known after apply)
      + certificate_arn          = (known after apply)
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port ...
```

</details>

